# -*- coding: utf-8 -*-
#/usr/bin/python

class Hyperparams:
    '''Hyper parameters'''
    token_type = "j" # char (character) | j (Hangul jamo) | sj (Hagul jamo single) | hcj (hangul compatibility jamo) | shcj (single hangul compatibility jamo)

    # signal processing
    sr = 22050  # Sampling rate.
    n_fft = 2048  # fft points (samples)
    frame_shift = 0.0125  # seconds
    frame_length = 0.05  # seconds
    hop_length = int(sr * frame_shift)  # samples. =276.
    win_length = int(sr * frame_length)  # samples. =1102.
    n_mels = 80  # Number of Mel banks to generate
    power = 1.5  # Exponent for amplifying the predicted magnitude
    n_iter = 50  # Number of inversion iterations
    preemphasis = .97
    max_db = 100
    ref_db = 20

    # Model
    r = 4 # Reduction factor. Do not change this.
    dropout_rate = 0.05
    e = 128 # == embedding
    d = 256 # == hidden units of Text2Mel
    c = 512 # == hidden units of SSRN
    attention_win_size = 3

    # data
    data = "../jss"

    if token_type == "char":
        vocab = "␀␃ !,.?ᄀᄁᄂᄃᄄᄅᄆᄇᄈᄉᄊᄋᄌᄍᄎᄏᄐᄑᄒᅌᅨᆞᆢᆨᆫᆮᆯᆰᆱᆷᆸᆺᆼᆽᆾ" \
                "가각간갈감갑값갓갔강갖같개객갠갤갯갱거걱걲건걷걸검겁것겅겉겊게겐겔겜겟겠겡겨격겪견결겸겹겻경곁계" \
                "고곡곤곧골곰곱곳공곶과곽관괄광괘괜괭괴교굘구국군굳굴굵굶굼굽굿궁궂궈권궝궤궨궹귀귄귓규균귤그극근" \
                "귿글긁금급긋긔기긴길김깁깃깅까깍깎깐깔깜깝깟깡깥깨깻꺼꺽꺾껀껄껌껍껏껑께껜껠껫껭껴꼇꼉꼬꼭꼴꼼꼽" \
                "꼿꽁꽂꽃꽈꽉꽛꽝꽤꽹꾸꾹꾼꿀꿈꿔꿩꿰뀌뀐뀔끄끅끈끊끌끓끔끕끗끝끠끼낀낄낌낍나낙난날남납낫났낭낮낳" \
                "내낵낸낼냄냅냇냈냉냐냑냥너넉넌널넓넘넙넝넣네넥넨넷넹녀녁년녈념녑녓녕녘녜녠노녹논놀놈놉놋농높놓놔" \
                "놘놤놧놩뇌뇨누눅눈눌눔눕눙눠눵뉴늄느늑는늘늙늠능늦늬늴니닌닐님닙닝다닥닦단닫달닭닮담답닷당닿대댄" \
                "댈댓댕댜더덕던덜덟덤덥덧덩덮데덴델뎀뎃뎅뎌뎡도독돈돋돌돔돗동돠돵돼되된될됩두둑둔둘둠둡둥둬둰둿뒁" \
                "뒈뒌뒐뒘뒙뒛뒝뒤뒨뒷드득든듣들듬듭듯등듸듼딋디딘딜딧딪따딱딴딸땅때땐땔땡떠떡떤떨떰떳떵떻떼뗀뗌뗑" \
                "또똑똥뚜뚝뚤뚱뛰뛸뜨뜩뜬뜯뜰뜸뜻띄띠띤라락란람랍랏랐랑랗래랜랫랭랴략량러럭런럴럼럽럿렁렇레렉렌렙" \
                "렛렝려력련렬렴렵렷렸령렿례롄로록론롬롭롯롱롸뢈뢍료룐룔루룩룬룰룸룹룻룽뤌뤠류륜률륨르륵른를름릅릇" \
                "릉릎리린릴림립릿마막만많말맑맙맛망맞맡맣매맥맨맬맴맵맷맹머먹먼멀멈멋멍멓메멕멘멜멤멥멧멩멪멫며면" \
                "몃명몇몟모목몬몰몸못몽묏묘묫무묵묶문묻물뭄뭇뭉뭐뭔뭘뭣므믄믈믐믓미믹민믿밀밋밍밑바박밖반받발밟밤밥" \
                "밧방밭배백뱀뱃뱅버벅번벋벌범법벗벙벚베벡벤벨벳벵벼벽변별볏병볕보복볶본볼볿봄봅봇봉봐봔봠봣봤봥봬부" \
                "북분불붉붐붑붓붕붙붸브븐블비빈빌빕빗빙빛빠빡빤빨빵빼뺏뺑뻐뻔뻘뻬뻿뼝뽀뽄뽐뽑뽕뿌뿐뿔뿜쁘쁜삐삔삘삣" \
                "삥사삭산살삶삼삽삿상새색샌샐샛생샤서석섞선섣설섬섭섯성섶세섹센셀셉셋셍셔션셤셧셨셰소속손솔솜솟송솥" \
                "솨쇠쇼수숙순숟술숨숫숭숯숲숸쉐쉔쉘쉥쉬쉰쉽슈스슨슬슴습슷승싀싓시식신싣실싫심십싯싱싶싸싹싼쌀쌂쌈쌉" \
                "쌋쌍쌓쌔쌩써썩썬썰썸썹썻썽쎄쎅쎈쏘쏙쏠쏴쑤쑥쑨쑬쑵쑹쒀쒄쒓쒕쒜쒯쓰쓴쓸씀씁씌씨씩씬씰씸씹씻아악안앉" \
                "않알암압앗앙앚앞애액야약얀얄얇얌얍양얕얗얘어억언얹얻얼얽엄업없엇었엉엌엎에엔엘엣엥여역엮연열염엽엿" \
                "였영옆예옌옛옝오옥온올옮옳옴옵옷옹옻와왁완왈왐왓왔왕왜외요욕욜용우욱운울움웁웃웅워웍원월웜웟웠웡웨" \
                "웬웸웻웽위윌윗유육윤율윷으은을음읍응의읜읠이익인일읽잃임입잇있잊잎자작잔잖잘잠잡잣장잦재잿쟁저적전" \
                "절젊점접젓정젖제젠젤젭젯젱져젼졈졋졌졍조족존졸좀좁종좋좌죄주죽준줄줌줍줏중줘줙줜줨줫줬줭줴쥐쥑즈즉" \
                "즌즐즘증지직진짇질짊짐집짓징짚짛짜짝짠짤짧짬짭짱째쨋쨌쩌쩍쩐쩡쩨쩬쪄쪈쪗쪙쪼쪽쫄쫌쫑쫙쬐쭈쭉쭐쭤쮀" \
                "쯤찌찍찐찔찜찝찡찢찧차착찬찮찰참찹찻창찾채책챈처척천철첨첩첫청체첵첸쳇쳉쳐쳔쳣쳤쳥초촉촌촐촘촛총촤" \
                "촷촹최추축춘출춤춥충춰췅췌취측츰층치칙친칠칡침칩칫칭카칸칼캅캉캐커컨컬컴컵컷컸컹케켄켈켜켠켯켰켱코" \
                "콕콘콜콤콥콩쿠쿡쿤쿨쿵퀘퀴큇큐크큰클큼큽키킬킴킵킹타탁탄탈탐탑탓탕태택탯탱터턱턴털텀텁텃텅테텐텔텝" \
                "텟텡토톡톤톧톨톰톱톳통톼퇏퇴투툭툰퉁퉤퉷튀트특튼튿틀틈틉틑틔티파팍판팔팝팟팡팥패팬팽퍼퍽펌펏펑페펜" \
                "펭펴편평폐포폭폰폴폽퐁표푸푹푼풀품풉풍프픈플픕피픽핀필핏하학한할함합핫항해핸핼햇했행향허헌헐험헙헛" \
                "헝헤헨헴헷헸헹혀현혈협혓형혜호혹혼홀홈홉홋홍화확환활황회효횹후훅훈훌훍훑훗훤훼휄휏휘휠휴흐흑흔흘흙" \
                "흡희흰흴히힌힐힘힝"
        max_N, max_T = 106, 380
    elif token_type == "j":
        vocab = '␀␃ !,.?ᄀᄁᄂᄃᄄᄅᄆᄇᄈᄉᄊᄋᄌᄍᄎᄏᄐᄑᄒᅌᅡᅢᅣᅤᅥᅦᅧᅨᅩᅪᅫᅬᅭᅮᅯᅰᅱᅲ' \
                'ᅳᅴᅵᆞᆢᆨᆩᆫᆬᆭᆮᆯᆰᆱᆲᆴᆶᆷᆸᆹᆺᆻᆼᆽᆾᆿᇀᇁᇂ'
        max_N, max_T = 220, 380
    elif token_type == "sj":
        vocab = '␀␃ !,.?ᄀᄂᄃᄅᄆᄇᄉᄋᄌᄎᄏᄐᄑᄒᅌᅡᅢᅣᅤᅥᅦᅧᅨᅩᅪᅫᅬᅭᅮᅯᅰᅱᅲ' \
                'ᅳᅴᅵᆞᆢᆨᆫᆮᆯᆷᆸᆺᆼᆽᆾᆿᇀᇁᇂ'
        max_N, max_T = 220, 380
    elif token_type == "hcj":
        vocab = "␀␃ !,.?ㄱㄲㄴㄵㄶㄷㄸㄹㄺㄻㄼㄾㅀㅁㅂㅃㅄㅅㅆㅇㅈㅉㅊㅋㅌㅍㅎㅏㅐㅑㅒㅓㅔㅕㅖㅗㅘㅙㅚㅛㅜㅝㅞㅟㅠㅡㅢㅣㆍᆢ"
        max_N, max_T = 220, 380
    elif token_type == "shcj":
        vocab = "␀␃ !,.?ㄱㄴㄷㄹㅁㅂㅅㅇㅈㅊㅋㅌㅍㅎㅏㅐㅑㅒㅓㅔㅕㅖㅗㅘㅙㅚㅛㅜㅝㅞㅟㅠㅡㅢㅣㆍᆢ"
        max_N, max_T = 220, 380


    # training scheme
    lr = 0.001 # Initial learning rate.
    logdir = "logdir/{}".format(token_type)
    sampledir = 'samples/{}'.format(token_type)
    B = 8 # batch size
    num_iterations = 200000
